{
    "header": {
        "languageButton": "DE",
        "aboutMe": "Über mich",
        "skills": "Fähigkeiten",
        "portfolio": "Projekte"
    },
    "landingPage": {
        "me": "Ich bin",
        "job": "Software Entwickler",
        "buttonTalk":"Lass uns reden",
        "scrollDown": "Runter springen"
    },
    "aboutMe": {
        "title": "Über mich",
        "textMain": "Hallo! Ich bin Luft Alexander, ein angehender Junior Fullstack Entwickler mit einem starken Fokus auf Webentwicklungen mit Angular. Mit soliden Kenntnissen in HTML, CSS und JavaScript/Typescript bringe ich kreative Lösungen und Leidenschaft für agile Software-Entwicklung in jedes Projekt ein. Mein Hintergrund als Gamer hat mir wertvolle Erfahrungen in kleineren Projekten eingebracht, bei denen ich als Softwareentwickler mitwirken durfte.",
        "textKnowledge": "In den letzten 3 Jahren konnte ich mir wertvolle Erfahrungen sammeln, an Projekten die ich Unterstützt habe. Angefangen hat es mit einem Gaming-Projekt, bei dem ich zunächst als Mapper im Team aushelfen wollte. Durch meine herausragende Leistung im Mapping wurde ich vom Projektleiter positiv wahrgenommen. Er erkannte mein Potenzial und bot mir zusammen mit dem Projektowner die Möglichkeit, das Team als Administrator zu unterstützen. Später wurde ich dann auch als Softwareentwickler aktiv und habe mich eigenständig Schritt für Schritt durch LUA-Scripts, JavaScript, HTML und CSS gearbeitet, um Probleme zu analysieren und zu beseitigen.",
        "textSkills": "Warum Softwareentwicklung? Während meiner Tätigkeiten in kleineren Projekten hat sich für mich herauskristallisiert, dass mir Softwareentwicklung liegt und Freude bereitet. Die Teams bemerkten, dass ich mich sehr intensiv in die Thematik eingearbeitet habe und waren von meiner Leistung beeindruckt, weshalb sie mir immer wieder nahelegten, mir Gedanken darüber zu machen, die Softwareentwicklung beruflich auszuüben. Durch diese Ermutigung wurde mir klar, dass Softwareentwicklung meine berufliche Zukunft ist. Um mich auf ein professionelles Niveau zu bringen, habe ich mich entschieden, meine Weiterbildung bei der Developer Akademie zu absolvieren."
    },
    "skills": {
        "title": "Skills",
        "text": "Ein paar dinge über mich(.3.) Donec ut imperdiet diam, et convallis neque. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos himenaeos.",
        "button": "Mehr erfahren"
    },
    "portfolio": {
        "title": "Projekte",
        "text1": "Erkunde hier eine Auswahl meiner Arbeiten - Interagiere mit Projekten",
        "text2": "um meine Fähigkeiten in Aktion zu sehen.",
        "button": "Testen"
    },
    "contact":{
        "title": "Kontakt",
        "question1": "Sie haben ein Problem?",
        "question2": "Brauchen sie einen Software Entwickler?",
        "contactMe":"Kontakieren Sie mich",
        "text": "Kontaktiere mich über dieses Formular, ich bin daran interessiert, von dir zu hören, deine Ideen kennenzulernen und mit meiner Arbeit zu deinen Projekten beizutragen.",
        "button": "Nachricht senden"
    },
    "form":{
        "name": "Dein Name",
        "email": "Deine Email",
        "message": "Deine Nachricht",
        "send": "Nachricht Senden",
        "text1":"Ich habe die ",
        "text2":"und stimme der Verarbeitung meiner Daten gemäß den Angaben zu.",
        "privacy":"Datenschutzerklärung",
        "sendSucces":"Deine Nachricht wurde verschickt!"
    },
    "join": {
        "textProjekt": "Ich bin immer auf der Suche nach neuen Herausforderungen und Möglichkeiten, als Entwickler zu lernen und zu wachsen. Wenn du daran interessiert bist, mit mir zusammenzuarbeiten, nimm bitte Kontakt auf."
    },
    "pokedex": {
        "textProjekt": "Eine einfache Pokedex-App, die es dir ermöglicht, nach Pokemon zu suchen und deren Details anzusehen. Dieses Projekt wurde mit der PokeAPI und Vanilla JavaScript erstellt."
    },
    "sharkie": {
        "textProjekt": "Ein einfaches Jump-and-Run-Spiel basierend auf einem objektorientierten Ansatz. Hilf Sharkie, Münzen und Giftflaschen zu finden, um gegen den Killerwal zu kämpfen."
    },
    "footer": {
        "imprint": "Impressum"
    },
    "imprint": {
        "contact": "Kontakt",
        "wrapper": "Impressum",
        "headline": "Angaben gemäß § 5 TMG",
        "phone": "Telefon:",
        "email": "E-Mail:"
    }

}
