{
    "header": {
        "languageButton": "DE",
        "aboutMe": "Über mich",
        "skills": "Fähigkeiten",
        "portfolio": "Projekte"
    },
    "landingPage": {
        "me": "Ich bin",
        "job": "Fullstack Entwickler",
        "buttonTalk":"Kontakt",
        "scrollDown": "Projekte"
    },
    "aboutMe": {
        "title": "Über mich",
        "textMain": "Hallo! Ich bin Alexander Luft, ein Fullstack Entwickler mit Erfahrung in der Umsetzung von Projekten mit JavaScript, TypeScript, Angular und Django. Logisches Denken, eigenverantwortliches Arbeiten und kreative Lösungsansätze zählen zu meinen Stärken. Diese Fähigkeiten machen mich in Teams nicht nur beim Planen von Architekturen und Debugging zu einem gefragten Ansprechpartner, sondern auch bei der Umsetzung.",
        "textKnowledge": "Ich bin jemand, der gerne das große Ganze im Blick hat und logische Zusammenhänge erkennt, sei es in Projekten, im Team oder bei komplexen Herausforderungen. Diese Fähigkeit hilft mir, Probleme strukturiert anzugehen und durchdachte Lösungen zu entwickeln.",
        "textSkills": "Seit 2019 arbeite ich im privaten Umfeld an Gaming-Projekten und habe dabei wertvolle Erfahrungen gesammelt. Was zunächst als Mapper begann, entwickelte sich schnell weiter vom Administrator bis hin zum Softwareentwickler."
    },
    "skills": {
        "title": "Skills",
        "text": "Ich habe Erfahrung im Aufbau von Projekten mit verschiedenen Technologien und Konzepten gesammelt. Hier sind einige meiner Fähigkeiten die ich während meiner Weiterbildung vertieft und angeeignet habe.",
        "button": "Mehr erfahren"
    },
    "portfolio": {
        "title": "Projekte",
        "text1": "Erkunden sie hier eine Auswahl meiner Arbeiten - Interagieren sie mit Projekten",
        "text2": "um meine Fähigkeiten in Aktion zu sehen.",
        "button": "Testen"
    },
    "contact":{
        "title": "Kontakt",
        "question1": "Sie haben ein Problem?",
        "question2": "Brauchen sie einen Software Entwickler?",
        "contactMe":"Kontakieren Sie mich",
        "text": "Kontaktieren sie mich über dieses Formular, ich bin daran interessiert, von ihnen zu hören, ihre Ideen kennenzulernen und mit meiner Arbeit zu ihren Projekten beizutragen.",
        "button": "Nachricht senden"
    },
    "form":{
        "name": "Ihre Name",
        "email": "Ihre Email",
        "message": "Ihre Nachricht",
        "send": "Nachricht Senden",
        "text1":"Ich habe die ",
        "text2":"und stimme der Verarbeitung meiner Daten gemäß den Angaben zu.",
        "privacy":"Datenschutzerklärung",
        "sendSucces":"Ihre Nachricht wurde verschickt!"
    },
    "join [frontend]": {
        "textProjekt": "Join das Kanban-Board, welches mit JavaScript entwickelt wurde. Als Vorlage diente ein Figma-Design, welches präzise umgesetzen werden sollte. Der Schwerpunkt lag auf der Umsetzung des Designs und der Zusammenarbeit des Teams mit Kollaborationstools. Besonders herausfordernd war für mich, die Designvorgaben exakt einzuhalten und gleichzeitig den Überblick bei der Arbeit im Team zu behalten."
    },
    "videoflix [fullstack]": {
        "textProjekt": "Videoflix ist ein Streaming-Service, für das Frontend wurde Angular verwendet und das Backend wurde mit Django entwickelt. Der Schwerpunkt lag auf der Planung und Umsetzung der Architektur und der Kommunikation zwischen Frontend und Backend und dem Deployment. Besonders viel Freude hat mir die Konfiguration des Backend-Servers bereitet, den eingerichtet und erfolgreich in Betrieb genommen habe."
    },
    "coderr [backend]": {
        "textProjekt": "Coderr ist ein Projekt, das auf Django und dem Django Rest Framework basiert. Der Schwerpunkt lag darauf, die Backend Kommunikation zu einem bestehendem Frontend zu implementieren und die Anforderungen einer vorgegebenen Checkliste zu erfüllen. Die Planung und Umsetzung der Backend Architektur sowie die Konfiguration des Servers waren für mich besonders spannend, da ich zwei Backend Projekte auf einem Server betrieben habe."
    },
    "dabubble [frontend]": {
        "textProjekt": "DaBubble ist eine Chat-App, das auf Angular basiert und die Google Firebase verwendet. Der Schwerpunkt bei diesem Projekt lag auf der Implementierung einer Realtime Kommunikation zwischen den Nutzern und der Anbindung an Firebase. Die Plannung der Datenbankstruktur und die Umsetzung der Realtime Kommunikation mit Observables waren für mich besonders spannend."
    },
    "footer": {
        "imprint": "Impressum"
    },
    "imprint": {
        "contact": "Kontakt",
        "wrapper": "Impressum",
        "headline": "Angaben gemäß § 5 TMG",
        "phone": "Telefon:",
        "email": "E-Mail:"
    }
}
