{
    "header": {
        "languageButton": "EN",
        "aboutMe": "About me",
        "skills": "Skills",
        "portfolio": "Portfolio"
    },
    "landingPage": {
        "me": "I am",
        "job": "Frontend developer",
        "buttonTalk":"Let`s talk",
        "scrollDown": "Scroll down"
    },
    "aboutMe": {
        "title": "About me",
        "textMain": "Hello! I'm Alexander Luft, an aspiring Fullstack Developer with a strong focus on web development using Angular. With solid skills in HTML, CSS, and JavaScript/TypeScript, I bring creative solutions and a passion for agile software development to every project. My background as a gamer has provided me with valuable experience in smaller projects where I had the opportunity to contribute as a software developer.",
        "textKnowledge": "In the last four years, I have gained valuable experience through various projects. I started as a mapper in a gaming project and progressed to an administrator and later to a software developer, acquiring skills in LUA, JavaScript, HTML, and CSS along the way.",
        "textSkills": "Why software development? Through these projects, I discovered that software development suits me and brings me joy. To elevate the skills I have self-taught to a professional level, I decided to pursue further education at the Developer Academy."
    },
    "skills": {
        "title": "Skills",
        "text": "I have gained experience in building projects with various technologies and concepts. Here are some of the skills I have deepened and acquired during my further education.",
        "button": "Get in touch"
    },
    "portfolio": {
        "title": "Portfolio",
        "text1": "Explore a selection of my work here - Interact with projects ",
        "text2": " to see my skills in action.",
        "button": "Live Test"
    },
    "contact":{
        "title": "Contact",
        "question1": "Got a problem to solve?",
        "question2": "Need a Frontend developer?",
        "contactMe":"Contact me",
        "text": "Contact me through this form, I am interested in hearing from you, knowing your ideas and contributing to yourprojects with my work.",
        "button": "Send message"
    },
    "form":{
        "name": "Your Name",
        "email": "Your Email",
        "message": "Your Message",
        "send": "Send Message",
        "text1":"I've read the ",
        "text2":" and agree to the processing of my data as outlined.",
        "privacy":"privacy policy",
        "sendSucces":"Your message has been sent!"
    },
    "join": {
        "textProjekt": "This is a Kanban board that I developed as part of a group project with my teammates for the completion of the JavaScript module. The project is currently being updated with Angular and is receiving its own backend integration."
    },
    "pokedex": {
        "textProjekt": "A Pokedex app that allows users to search for Pokémon and view their details. This project was created using the PokeAPI and vanilla JavaScript."
    },
    "sharkie": {
        "textProjekt": "A simple jump-and-run game based on an object-oriented approach. Help Sharkie find coins and poison bottles to battle the killer whale."
    },
    "footer": {
        "imprint": "Imprint"
    },
    "imprint": {
        "contact": "Contact",
        "wrapper": "Legal Notice",
        "headline": "Legal Notice according to § 5 TMG",
        "phone": "Phone:",
        "email": "E-Mail:"
    }
}