{
    "header": {
        "languageButton": "EN",
        "aboutMe": "About me",
        "skills": "Skills",
        "portfolio": "Portfolio"
    },
    "landingPage": {
        "me": "I am",
        "job": "Frontend developer",
        "buttonTalk":"Let`s talk",
        "scrollDown": "Scroll down"
    },
    "aboutMe": {
        "title": "About me",
        "textMain": "Hello! I'm Alexander Luft, an aspiring Fullstack Developer with a strong focus on web development using Angular. With solid skills in HTML, CSS, and JavaScript/TypeScript, I bring creative solutions and a passion for agile software development to every project. My background as a gamer has provided me with valuable experience in smaller projects where I had the opportunity to contribute as a software developer.",
        "textKnowledge": "In the last four years, I have gained valuable experience through various projects. I started as a mapper in a gaming project and progressed to an administrator and later to a software developer, acquiring skills in LUA, JavaScript, HTML, and CSS along the way.",
        "textSkills": "Why software development? Through these projects, I discovered that software development suits me and brings me joy. To elevate the skills I have self-taught to a professional level, I decided to pursue further education at the Developer Academy."
    },
    "skills": {
        "title": "Skills",
        "text": "I have gained experience in building projects with various technologies and concepts. Here are some of the skills I have deepened and acquired during my further education.",
        "button": "Get in touch"
    },
    "portfolio": {
        "title": "Portfolio",
        "text1": "Explore a selection of my work here - Interact with projects ",
        "text2": " to see my skills in action.",
        "button": "Live Test"
    },
    "contact":{
        "title": "Contact",
        "question1": "Got a problem to solve?",
        "question2": "Need a Frontend developer?",
        "contactMe":"Contact me",
        "text": "Contact me through this form, I am interested in hearing from you, knowing your ideas and contributing to yourprojects with my work.",
        "button": "Send message"
    },
    "form":{
        "name": "Your Name",
        "email": "Your Email",
        "message": "Your Message",
        "send": "Send Message",
        "text1":"I've read the ",
        "text2":" and agree to the processing of my data as outlined.",
        "privacy":"privacy policy",
        "sendSucces":"Your message has been sent!"
    },
    "join": {
        "textProjekt": "Join is a Kanban board that I developed as part of a group project using JavaScript. The project was based on a Figma design, which we had to implement precisely. The focus was on implementing the design and collaborating via GitHub. The most challenging part for me was adhering to the design specifications while maintaining an overview during teamwork."
    },
    "videoflix": {
        "textProjekt": "Videoflix is a streaming service that I developed with my classmates as a group project to conclude the backend module. I was able to apply my entire tech stack to successfully meet the diverse requirements of the project. I particularly enjoyed configuring the backend server, which everyone set up and operated independently."
    },
    "coderr": {
        "textProjekt": "Coderr is a project based on Django and the Django Rest Framework. The focus was on implementing communication between the frontend and backend and meeting the requirements of a predefined checklist. Subsequently, I handled the hosting configuration for my backend server to successfully operate two backend projects in parallel on the same server."
    },
    "pokedex": {
        "textProjekt": "A Pokedex app that allows users to search for Pokémon and view their details. In this project, I worked with the PokeAPI and Vanilla JavaScript. The focus was on querying the API interfaces and displaying the data in the frontend."
    },
    "sharkie": {
        "textProjekt": "Sharkie is a simple jump-and-run game based on an object-oriented approach. The challenge was mastering object-oriented programming in this project. Sharkie was a challenging yet highly enjoyable experience for me."
    },
    "footer": {
        "imprint": "Impressum"
    },
    "imprint": {
        "contact": "Contact",
        "wrapper": "Legal Notice",
        "headline": "Legal Notice according to § 5 TMG",
        "phone": "Phone:",
        "email": "E-Mail:"
    }
}