{
    "header": {
        "languageButton": "EN",
        "aboutMe": "About me",
        "skills": "Skills",
        "portfolio": "Portfolio"
    },
    "landingPage": {
        "me": "I am",
        "job": "Frontend developer",
        "buttonTalk":"Let`s talk",
        "scrollDown": "Scroll down"
    },
    "aboutMe": {
        "title": "About me",
        "textMain": "Hello! I'm Alexander Luft, a fullstack developer with experience in implementing projects using JavaScript, TypeScript, Angular, and Django. Logical thinking, independent work, and creative problem-solving are among my strengths. These skills make me a valued point of contact in teams — not only when planning architectures and debugging but also during implementation.",
        "textKnowledge": "I am someone who likes to keep the big picture in mind and recognize logical connections — whether in projects, within a team, or when facing complex challenges. This ability helps me approach problems in a structured way and develop well-thought-out solutions.",
        "textSkills": "Since 2019, I have been working on gaming projects in a private environment and have gained valuable experience in the process. What initially started as a mapper quickly evolved — from administrator to software developer."
    },
    "skills": {
        "title": "Skills",
        "text": "I have gained experience in building projects with various technologies and concepts. Here are some of the skills I have deepened and acquired during my further education.",
        "button": "Get in touch"
    },
    "portfolio": {
        "title": "Portfolio",
        "text1": "Explore a selection of my work here - Interact with projects ",
        "text2": " to see my skills in action.",
        "button": "Live Test"
    },
    "contact":{
        "title": "Contact",
        "question1": "Got a problem to solve?",
        "question2": "Need a Frontend developer?",
        "contactMe":"Contact me",
        "text": "Contact me through this form, I am interested in hearing from you, knowing your ideas and contributing to yourprojects with my work.",
        "button": "Send message"
    },
    "form":{
        "name": "Your Name",
        "email": "Your Email",
        "message": "Your Message",
        "send": "Send Message",
        "text1":"I've read the ",
        "text2":" and agree to the processing of my data as outlined.",
        "privacy":"privacy policy",
        "sendSucces":"Your message has been sent!"
    },
    "join [frontend]": {
        "textProjekt": "Join is a Kanban board developed with JavaScript. The project was based on a Figma design that had to be implemented with precision. The focus was on translating the design accurately and collaborating effectively as a team using collaboration tools. The biggest challenge for me was to adhere precisely to the design specifications while maintaining an overview of the team's progress."
    },
    "videoflix [fullstack]": {
        "textProjekt": "Videoflix is a streaming service where Angular was used for the frontend and Django for the backend. The focus was on planning and implementing the architecture, ensuring seamless communication between the frontend and backend, and deploying the application. I particularly enjoyed configuring the backend server, which I set up and successfully brought into operation."
    },
    "coderr [backend]": {
        "textProjekt": "Coderr is a project based on Django and the Django Rest Framework. The focus was on implementing the backend communication for an existing frontend and meeting the requirements of a predefined checklist. Planning and implementing the backend architecture, as well as configuring the server, were particularly exciting for me, as I successfully operated two backend projects on a single server."
    },
    "dabubble [frontend]": {
        "textProjekt": "DaBubble is a Chat App based on Angular that utilizes Google Firebase. The focus of this project was on implementing real-time communication between users and integrating it with Firebase. Planning the database structure and implementing real-time communication using Observables were particularly exciting for me."
    },
    "footer": {
        "imprint": "Legal Notice"
    },
    "imprint": {
        "contact": "Contact",
        "wrapper": "Legal Notice",
        "headline": "Legal Notice according to § 5 TMG",
        "phone": "Phone:",
        "email": "E-Mail:"
    }
}